; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_16_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 - counter
	)
  (:init
		(= (value c0) 94)
	(= (value c1) 65)
	(= (value c2) 12)
	(= (value c3) 51)
	(= (value c4) 48)
	(= (value c5) 18)
	(= (value c6) 71)
	(= (value c7) 95)
	(= (value c8) 36)
	(= (value c9) 64)
	(= (value c10) 22)
	(= (value c11) 79)
	(= (value c12) 62)
	(= (value c13) 0)
	(= (value c14) 93)
	(= (value c15) 70)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
		)
	)
)

; plan
1. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 15
2. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 15
3. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 6 of 15
4. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 6 of 15
5. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 6 of 15
6. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 6 of 15
7. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 6 of 15
8. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 6 of 15
9. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 6 of 15
10. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 6 of 15
11. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 6 of 15
12. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 6 of 15
13. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 6 of 15
14. (increment c4)
   changed: (value c4) from 48 to 52
   goals met: 7 of 15
15. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 7 of 15
16. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 7 of 15
17. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 7 of 15
18. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 15
19. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 15
20. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 7 of 15
21. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 7 of 15
22. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 7 of 15
23. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 15
24. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 7 of 15
25. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 15
26. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 7 of 15
27. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 7 of 15
28. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 7 of 15
29. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 7 of 15
30. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 7 of 15
31. (decrement c4)
   changed: (value c4) from 52 to 47
   goals met: 6 of 15
32. (increase_rate c15)
   changed: (rate_value c15) from 3 to 4
   goals met: 6 of 15
33. (increase_rate c15)
   changed: (rate_value c15) from 4 to 5
   goals met: 6 of 15
34. (increase_rate c15)
   changed: (rate_value c15) from 5 to 6
   goals met: 6 of 15
35. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 6 of 15
36. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 6 of 15
37. (increment c15)
   changed: (value c15) from 70 to 76
   goals met: 6 of 15
38. (increment c15)
   changed: (value c15) from 76 to 82
   goals met: 6 of 15
39. (increment c15)
   changed: (value c15) from 82 to 88
   goals met: 6 of 15
40. (increment c15)
   changed: (value c15) from 88 to 94
   goals met: 7 of 15
41. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 7 of 15
42. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 7 of 15
43. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 7 of 15
44. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 7 of 15
45. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 7 of 15
46. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 7 of 15
47. (decrement_rate c12)
   changed: (rate_value c12) from 1 to 0
   goals met: 7 of 15
48. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 7 of 15
49. (increase_rate c13)
   changed: (rate_value c13) from 6 to 7
   goals met: 7 of 15
50. (increase_rate c13)
   changed: (rate_value c13) from 7 to 8
   goals met: 7 of 15
51. (increment c13)
   changed: (value c13) from 0 to 8
   goals met: 7 of 15
52. (increment c13)
   changed: (value c13) from 8 to 16
   goals met: 7 of 15
53. (increment c13)
   changed: (value c13) from 16 to 24
   goals met: 7 of 15
54. (increment c13)
   changed: (value c13) from 24 to 32
   goals met: 7 of 15
55. (increment c13)
   changed: (value c13) from 32 to 40
   goals met: 7 of 15
56. (increment c13)
   changed: (value c13) from 40 to 48
   goals met: 7 of 15
57. (increment c13)
   changed: (value c13) from 48 to 56
   goals met: 7 of 15
58. (increment c13)
   changed: (value c13) from 56 to 64
   goals met: 8 of 15
59. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 8 of 15
60. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 8 of 15
61. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 8 of 15
62. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 8 of 15
63. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 8 of 15
64. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 8 of 15
65. (increment c12)
   changed: (value c12) from 62 to 66
   goals met: 7 of 15
66. (increment c13)
   changed: (value c13) from 64 to 72
   goals met: 8 of 15
67. (increment c12)
   changed: (value c12) from 66 to 70
   goals met: 8 of 15
68. (increment c12)
   changed: (value c12) from 70 to 74
   goals met: 7 of 15
69. (increment c13)
   changed: (value c13) from 72 to 80
   goals met: 8 of 15
70. (increment c12)
   changed: (value c12) from 74 to 78
   goals met: 8 of 15
71. (decrement c11)
   changed: (value c11) from 79 to 77
   goals met: 9 of 15
72. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 9 of 15
73. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 9 of 15
74. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 9 of 15
75. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 9 of 15
76. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 9 of 15
77. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 9 of 15
78. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 9 of 15
79. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 9 of 15
80. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 9 of 15
81. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 9 of 15
82. (increment c10)
   changed: (value c10) from 22 to 29
   goals met: 9 of 15
83. (increment c10)
   changed: (value c10) from 29 to 36
   goals met: 9 of 15
84. (increment c10)
   changed: (value c10) from 36 to 43
   goals met: 9 of 15
85. (increment c10)
   changed: (value c10) from 43 to 50
   goals met: 9 of 15
86. (increment c10)
   changed: (value c10) from 50 to 57
   goals met: 9 of 15
87. (increment c10)
   changed: (value c10) from 57 to 64
   goals met: 9 of 15
88. (increment c10)
   changed: (value c10) from 64 to 71
   goals met: 10 of 15
89. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 10 of 15
90. (increment c8)
   changed: (value c8) from 36 to 45
   goals met: 10 of 15
91. (increment c8)
   changed: (value c8) from 45 to 54
   goals met: 10 of 15
92. (increment c8)
   changed: (value c8) from 54 to 63
   goals met: 10 of 15
93. (increment c8)
   changed: (value c8) from 63 to 72
   goals met: 9 of 15
94. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 9 of 15
95. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 9 of 15
96. (decrement c8)
   changed: (value c8) from 72 to 62
   goals met: 10 of 15
97. (decrement c7)
   changed: (value c7) from 95 to 90
   goals met: 10 of 15
98. (increment c8)
   changed: (value c8) from 62 to 72
   goals met: 9 of 15
99. (decrement c7)
   changed: (value c7) from 90 to 85
   goals met: 9 of 15
100. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 9 of 15
101. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 9 of 15
102. (increment c4)
   changed: (value c4) from 47 to 52
   goals met: 10 of 15
103. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 10 of 15
104. (increment c5)
   changed: (value c5) from 18 to 24
   goals met: 10 of 15
105. (increment c5)
   changed: (value c5) from 24 to 30
   goals met: 10 of 15
106. (increment c5)
   changed: (value c5) from 30 to 36
   goals met: 10 of 15
107. (increment c5)
   changed: (value c5) from 36 to 42
   goals met: 10 of 15
108. (increment c5)
   changed: (value c5) from 42 to 48
   goals met: 10 of 15
109. (increment c5)
   changed: (value c5) from 48 to 54
   goals met: 11 of 15
110. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 11 of 15
111. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 11 of 15
112. (increment c2)
   changed: (value c2) from 12 to 20
   goals met: 11 of 15
113. (increment c2)
   changed: (value c2) from 20 to 28
   goals met: 11 of 15
114. (increment c2)
   changed: (value c2) from 28 to 36
   goals met: 11 of 15
115. (increment c2)
   changed: (value c2) from 36 to 44
   goals met: 11 of 15
116. (increment c2)
   changed: (value c2) from 44 to 52
   goals met: 10 of 15
117. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 10 of 15
118. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 10 of 15
119. (increment c2)
   changed: (value c2) from 52 to 62
   goals met: 10 of 15
120. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 10 of 15
121. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 10 of 15
122. (decrement c8)
   changed: (value c8) from 72 to 62
   goals met: 11 of 15
123. (decrement c7)
   changed: (value c7) from 85 to 80
   goals met: 11 of 15
124. (decrement c7)
   changed: (value c7) from 80 to 75
   goals met: 11 of 15
125. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 11 of 15
126. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 11 of 15
127. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 11 of 15
128. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 11 of 15
129. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 11 of 15
130. (decrement c1)
   changed: (value c1) from 65 to 60
   goals met: 12 of 15
131. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 12 of 15
132. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 12 of 15
133. (increment c1)
   changed: (value c1) from 60 to 67
   goals met: 11 of 15
134. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 11 of 15
135. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 11 of 15
136. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 11 of 15
137. (increment c1)
   changed: (value c1) from 67 to 75
   goals met: 11 of 15
138. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 11 of 15
139. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 11 of 15
140. (increment c1)
   changed: (value c1) from 75 to 85
   goals met: 11 of 15
141. (increment c1)
   changed: (value c1) from 85 to 95
   goals met: 12 of 15
142. (increment c8)
   changed: (value c8) from 62 to 72
   goals met: 11 of 15
143. (increment c9)
   changed: (value c9) from 64 to 67
   goals met: 11 of 15
144. (increment c9)
   changed: (value c9) from 67 to 70
   goals met: 11 of 15
145. (increment c9)
   changed: (value c9) from 70 to 73
   goals met: 11 of 15
146. (increment c10)
   changed: (value c10) from 71 to 78
   goals met: 11 of 15
147. (increment c11)
   changed: (value c11) from 77 to 79
   goals met: 11 of 15
148. (increment c12)
   changed: (value c12) from 78 to 82
   goals met: 11 of 15
149. (increment c13)
   changed: (value c13) from 80 to 88
   goals met: 12 of 15
150. (decrement c7)
   changed: (value c7) from 75 to 70
   goals met: 12 of 15
151. (decrement c1)
   changed: (value c1) from 95 to 85
   goals met: 11 of 15
152. (decrement c1)
   changed: (value c1) from 85 to 75
   goals met: 11 of 15
153. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 11 of 15
154. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 11 of 15
155. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 11 of 15
156. (decrement c0)
   changed: (value c0) from 94 to 89
   goals met: 11 of 15
157. (decrement c0)
   changed: (value c0) from 89 to 84
   goals met: 11 of 15
158. (decrement c0)
   changed: (value c0) from 84 to 79
   goals met: 11 of 15
159. (decrement c0)
   changed: (value c0) from 79 to 74
   goals met: 12 of 15
160. (decrement c1)
   changed: (value c1) from 75 to 65
   goals met: 11 of 15
161. (decrement c1)
   changed: (value c1) from 65 to 55
   goals met: 12 of 15
162. (decrement c0)
   changed: (value c0) from 74 to 69
   goals met: 12 of 15
163. (decrement c0)
   changed: (value c0) from 69 to 64
   goals met: 12 of 15
164. (decrement c0)
   changed: (value c0) from 64 to 59
   goals met: 12 of 15
165. (decrement c0)
   changed: (value c0) from 59 to 54
   goals met: 13 of 15
166. (increment c3)
   changed: (value c3) from 51 to 53
   goals met: 12 of 15
167. (increment c4)
   changed: (value c4) from 52 to 57
   goals met: 12 of 15
168. (increment c5)
   changed: (value c5) from 54 to 60
   goals met: 13 of 15
169. (decrement c2)
   changed: (value c2) from 62 to 52
   goals met: 13 of 15
170. (decrement c1)
   changed: (value c1) from 55 to 45
   goals met: 13 of 15
171. (decrement c0)
   changed: (value c0) from 54 to 49
   goals met: 13 of 15
172. (decrement c0)
   changed: (value c0) from 49 to 44
   goals met: 14 of 15
173. (increment c7)
   changed: (value c7) from 70 to 75
   goals met: 14 of 15
174. (increment c8)
   changed: (value c8) from 72 to 82
   goals met: 14 of 15
175. (increment c9)
   changed: (value c9) from 73 to 76
   goals met: 14 of 15
176. (increment c9)
   changed: (value c9) from 76 to 79
   goals met: 13 of 15
177. (increment c10)
   changed: (value c10) from 78 to 85
   goals met: 13 of 15
178. (increment c11)
   changed: (value c11) from 79 to 81
   goals met: 13 of 15
179. (increment c9)
   changed: (value c9) from 79 to 82
   goals met: 13 of 15
180. (increment c9)
   changed: (value c9) from 82 to 85
   goals met: 13 of 15
181. (increment c10)
   changed: (value c10) from 85 to 92
   goals met: 14 of 15
182. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 14 of 15
183. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 14 of 15
184. (increment c11)
   changed: (value c11) from 81 to 85
   goals met: 13 of 15
185. (increment c12)
   changed: (value c12) from 82 to 86
   goals met: 14 of 15
186. (increment c11)
   changed: (value c11) from 85 to 89
   goals met: 13 of 15
187. (increment c12)
   changed: (value c12) from 86 to 90
   goals met: 13 of 15
188. (increment c13)
   changed: (value c13) from 88 to 96
   goals met: 13 of 15
189. (increment c14)
   changed: (value c14) from 93 to 95
   goals met: 12 of 15
190. (increment c15)
   changed: (value c15) from 94 to 100
   goals met: 13 of 15
191. (increment c14)
   changed: (value c14) from 95 to 97
   goals met: 14 of 15
192. (increment c11)
   changed: (value c11) from 89 to 93
   goals met: 14 of 15
193. (increment c12)
   changed: (value c12) from 90 to 94
   goals met: 15 of 15
